/* Кодын модулар архитектур
1. Аппын кодыг модулиудад хуваана. 
2. Модуль нь аппын карим хэсэг кодыг бусдаас тусдаа цэвэрхэн зохион байгуулттай агуулна. 
3. Модуль нь дотороо зарим өгөгдөл функүүдийг далдалж.  зарим өгөгдөл функүүдийг бусад модулиудад хуваалцахаар өгдөг.

// Системийн шинжилгээ зохиомж, 
хэрэглэгчийн шаардлага Системийн шинжээч нар харилцагч байгууллагатай уулзаж тэмдэглэж авна.
ямар2 мод 
1. Товчинд эвент листенер холбох 
2. Бичсэн утгуудыг авах 
3. Бичсэн утгуудыг дотороо хадгалах
4. Бичсэн утгуудыг дэлгэцэнд хадгалах 
5. Үлдэгдэл тооцоолох
6. Үлдэгдлийг дэлгэцэнд үзүүлэх */